create database Cinema 
go 
use Cinema
create table Users(
	ID int identity(1,1) primary key,
	Users_name varchar(50),
	Users_password varchar(50),
	Users_tel int,
	Role varchar(20)
)
insert into Users(Users_name,Users_password,Users_tel,Role) values
('ngocthien2902@gmail.com','thien2503','0702411147','user'),
('ngocdh0711@gmail.com','ngocsama','0392042457','admin');

-- Table Movies
Create table movies (
    id int identity(1,1) PRIMARY KEY,
    title nvarchar(50),
    duration_minutes int,
    image_url nvarchar(255),
    direction nvarchar(255),
    description nvarchar(500),
    starring nvarchar(255),
);

INSERT INTO movies (title, duration_minutes, image_url, direction, description, starring) VALUES 
(N'Avenger : Đại chiến Marvel', 181, N'img/avengers_endgame.jpg', N'Anthony Russo, Joe Russo', N'After a unique journey that continues to expand and develop the Marvel Cinematic Universe, Avengers: Infinity War will bring to the screen the most fierce final battle of all time. The Avengers and their superhero allies must accept to sacrifice everything to be able to fight against the mighty enemy Thanos before his ambition to destroy the entire universe.', N'Robert Downey Jr., Chris Hemsworth'),
(N'Doraemon: Nobita và Bản Giao Hưởng Địa Cầu', 115, N'img/doraemon.jpg', N'Kazuaki Imai', N'Doraemon and friends go on an adventure to meet new buddies, connect to people with music, and save the world from a crisis.',N'Wasabi Mizuta, Yumi Kakazu'),
(N'Lật mặt 7: Một điều ước', 138, N'img/latmat.jpg', N'Lý Hải', N'Một câu chuyện lần đầu được kể bằng tất cả tình yêu, và từ tất cả những hồi ức xao xuyến nhất của đấng sinh thành', N'Thanh Hiền, Trương Minh Cường, Đinh Y Nhung,..'),
(N'Kẻ Trộm Mặt Trăng 4', 99, N'img/minion.jpg', N'Mike White Ken Daurio', 'Gru, Lucy, Margo, Edith, and Agnes welcome a new member to the family', N'Steve Carell Kristen Wiig Will Ferrell Joey King Sofía Vergara Miranda Cosgrove Chloe Fineman Stephen Colbert Steve Coogan');

-- Table theater
CREATE TABLE theater (
    id int identity(1,1) primary key,
    name nvarchar(50) not null,
	location nvarchar(500)
);
INSERT INTO theater (name, location) VALUES 
(N'Đà Nẵng', N'12 Mỹ Đa Tây 8, Khuê Mỹ, NHS'),
(N'Hồ Chí Minh', N'126 Hùng Vương, Q.5, Tp. Hồ Chí Minh'),
(N'Hà Nội',  N'458 Minh Khai, Hai Bà Trưng, Tp. Hà Nội');


-- Table showtime
CREATE TABLE showtimes (
    id int identity(1,1) primary key,
    movie_id int not null,
    theater_id int not null,
    show_date date not null,
    show_time time not null,
    foreign key (movie_id) references movies(id),
    foreign key (theater_id) references theater(id)
);
-- Thêm các suất chiếu cho Doraemon: Bản giao hưởng tại các theater khác nhau
-- Đà Nẵng
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES (2, 1, '2024-07-11', '12:00'),
       (2, 1, '2024-07-11', '16:00'),
       (2, 1, '2024-07-11', '20:00'),
	   (2, 1, '2024-07-12', '16:00'),
       (2, 1, '2024-07-12', '20:00'),
	   (2, 1, '2024-07-13', '12:00'),
       (2, 1, '2024-07-13', '22:00'),
	   (2, 1, '2024-07-14', '10:00'),
       (2, 1, '2024-07-14', '15:00'),
	   (2, 1, '2024-07-14', '18:00'),
       (2, 1, '2024-07-14', '20:00'),
	   (2, 1, '2024-07-15', '11:00'),
       (2, 1, '2024-07-15', '16:00'),
	   (2, 1, '2024-07-15', '18:00'),
       (2, 1, '2024-07-15', '22:00'),
	   (2, 1, '2024-07-16', '8:00'),
       (2, 1, '2024-07-16', '13:00'),
	   (2, 1, '2024-07-16', '17:00'),
       (2, 1, '2024-07-16', '23:00'),
	   (2, 1, '2024-07-17', '9:00'),
       (2, 1, '2024-07-17', '14:00'),
	   (2, 1, '2024-07-17', '18:00'),
       (2, 1, '2024-07-17', '23:00');

-- Hồ Chí Minh
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES (2, 2, '2024-07-11', '12:00'),
       (2, 2, '2024-07-11', '16:00'),
       (2, 2, '2024-07-11', '20:00'),
	   (2, 2, '2024-07-12', '16:00'),
       (2, 2, '2024-07-12', '20:00'),
	   (2, 2, '2024-07-13', '12:00'),
       (2, 2, '2024-07-13', '22:00'),
	   (2, 2, '2024-07-14', '10:00'),
       (2, 2, '2024-07-14', '15:00'),
	   (2, 2, '2024-07-14', '18:00'),
       (2, 2, '2024-07-14', '20:00'),
	   (2, 2, '2024-07-15', '16:00'),
	   (2, 2, '2024-07-15', '18:00'),
       (2, 2, '2024-07-15', '22:00'),
	   (2, 2, '2024-07-16', '8:00'),
       (2, 2, '2024-07-16', '13:00'),
	   (2, 2, '2024-07-16', '15:00'),
       (2, 2, '2024-07-16', '20:00'),
	   (2, 2, '2024-07-16', '22:00'),
       (2, 2, '2024-07-16', '23:00'),
	   (2, 2, '2024-07-17', '9:00'),
       (2, 2, '2024-07-17', '14:00'),
	   (2, 2, '2024-07-17', '18:00');


-- Hà Nội
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES (2, 3, '2024-07-11', '12:00'),
       (2, 3, '2024-07-11', '16:00'),
       (2, 3, '2024-07-11', '20:00'),
	   (2, 3, '2024-07-12', '16:00'),
       (2, 3, '2024-07-12', '20:00'),
	   (2, 3, '2024-07-13', '12:00'),
       (2, 3, '2024-07-13', '22:00'),
	   (2, 3, '2024-07-14', '10:00'),
       (2, 3, '2024-07-14', '15:00'),
	   (2, 3, '2024-07-14', '18:00'),
       (2, 3, '2024-07-14', '20:00'),
	   (2, 3, '2024-07-15', '16:00'),
	   (2, 3, '2024-07-15', '18:00'),
       (2, 3, '2024-07-15', '22:00'),
	   (2, 3, '2024-07-16', '8:00'),
       (2, 3, '2024-07-16', '13:00'),
	   (2, 3, '2024-07-16', '15:00'),
       (2, 3, '2024-07-16', '20:00'),
	   (2, 3, '2024-07-16', '22:00'),
       (2, 3, '2024-07-16', '23:00'),
	   (2, 3, '2024-07-17', '9:00'),
       (2, 3, '2024-07-17', '14:00'),
	   (2, 3, '2024-07-17', '18:00'),
	   (2, 3, '2024-07-17', '20:00'),
       (2, 3, '2024-07-17', '22:00'),
	   (2, 3, '2024-07-17', '23:30');

-- Thêm các suất chiếu cho Lật Mặt: 48H tại các theater khác nhau
-- Đà Nẵng
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES
	   (3, 1, '2024-07-11', '12:00'),
       (3, 1, '2024-07-11', '16:00'),
       (3, 1, '2024-07-11', '20:00'),
	   (3, 1, '2024-07-12', '16:00'),
       (3, 1, '2024-07-12', '20:00'),
	   (3, 1, '2024-07-13', '12:00'),
       (3, 1, '2024-07-13', '22:00'),
	   (3, 1, '2024-07-14', '10:00'),
       (3, 1, '2024-07-14', '15:00'),
	   (3, 1, '2024-07-14', '18:00'),
       (3, 1, '2024-07-14', '20:00'),
	   (3, 1, '2024-07-15', '11:00'),
       (3, 1, '2024-07-15', '16:00'),
	   (3, 1, '2024-07-15', '18:00'),
       (3, 1, '2024-07-15', '22:00'),
	   (3, 1, '2024-07-16', '8:00'),
       (3, 1, '2024-07-16', '13:00'),
	   (3, 1, '2024-07-16', '17:00'),
       (3, 1, '2024-07-16', '23:00'),
	   (3, 1, '2024-07-17', '10:30'),
       (3, 1, '2024-07-17', '14:30'),
       (3, 1, '2024-07-17', '18:30');

-- Hồ Chí Minh
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES 
		(3, 2, '2024-07-11', '10:00'),
       (3, 2, '2024-07-11', '14:00'),
       (3, 2, '2024-07-11', '18:00'),
       (3, 2, '2024-07-11', '21:00'),
	   (3, 2, '2024-07-12', '10:00'),
       (3, 2, '2024-07-12', '14:00'),
       (3, 2, '2024-07-12', '18:00'),
       (3, 2, '2024-07-12', '21:00'),
	   (3, 2, '2024-07-13', '10:00'),
       (3, 2, '2024-07-13', '14:00'),
       (3, 2, '2024-07-13', '21:00'),
       (3, 2, '2024-07-14', '14:00'),
       (3, 2, '2024-07-14', '18:00'),
       (3, 2, '2024-07-14', '21:00'),
	   (3, 2, '2024-07-15', '9:00'),
       (3, 2, '2024-07-15', '20:00'),
	   (3, 2, '2024-07-16', '10:00'),
       (3, 2, '2024-07-16', '14:00'),
       (3, 2, '2024-07-16', '18:00'),
       (3, 2, '2024-07-16', '21:00'),
	   (3, 2, '2024-07-17', '12:30'),
       (3, 2, '2024-07-17', '16:30'),
       (3, 2, '2024-07-17', '20:30');

-- Hà Nội
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES 
	   (3, 3, '2024-07-11', '10:00'),
       (3, 3, '2024-07-11', '18:00'),
       (3, 3, '2024-07-11', '21:00'),
	   (3, 3, '2024-07-12', '10:00'),
       (3, 3, '2024-07-12', '14:00'),
       (3, 3, '2024-07-12', '18:00'),
       (3, 3, '2024-07-12', '21:00'),
	   (3, 3, '2024-07-13', '10:00'),
       (3, 3, '2024-07-13', '14:00'),
       (3, 3, '2024-07-13', '21:00'),
       (3, 3, '2024-07-14', '14:00'),
       (3, 3, '2024-07-14', '18:00'),
       (3, 3, '2024-07-14', '21:00'),
	   (3, 3, '2024-07-15', '9:00'),
       (3, 3, '2024-07-15', '20:00'),
	   (3, 3, '2024-07-16', '10:00'),
       (3, 3, '2024-07-16', '14:00'),
       (3, 3, '2024-07-16', '18:00'),
       (3, 3, '2024-07-16', '21:00'),
	   (3, 3, '2024-07-17', '11:30'),
       (3, 3, '2024-07-17', '15:30'),
       (3, 3, '2024-07-17', '19:30');

-- Thêm các suất chiếu cho Avengers: Endgame tại các theater khác nhau
-- Đà Nẵng
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES (1, 1, '2024-07-11', '10:00'),
       (1, 1, '2024-07-11', '14:00'),
       (1, 1, '2024-07-11', '18:00'),
       (1, 1, '2024-07-11', '21:00'),
	   (1, 1, '2024-07-12', '10:00'),
       (1, 1, '2024-07-12', '14:00'),
       (1, 1, '2024-07-12', '18:00'),
       (1, 1, '2024-07-12', '21:00'),
	   (1, 1, '2024-07-13', '10:00'),
       (1, 1, '2024-07-13', '14:00'),
       (1, 1, '2024-07-13', '21:00'),
       (1, 1, '2024-07-14', '14:00'),
       (1, 1, '2024-07-14', '18:00'),
       (1, 1, '2024-07-14', '21:00'),
	   (1, 1, '2024-07-15', '9:00'),
       (1, 1, '2024-07-15', '20:00'),
	   (1, 1, '2024-07-16', '10:00'),
       (1, 1, '2024-07-16', '14:00'),
       (1, 1, '2024-07-16', '18:00'),
       (1, 1, '2024-07-16', '21:00'),
       (1, 1, '2024-07-17', '21:00');

-- Hồ Chí Minh
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES (1, 2, '2024-07-11', '10:00'),
       (1, 2, '2024-07-11', '14:00'),
       (1, 2, '2024-07-11', '18:00'),
       (1, 2, '2024-07-11', '21:00'),
	   (1, 2, '2024-07-12', '10:00'),
       (1, 2, '2024-07-12', '14:00'),
       (1, 2, '2024-07-12', '18:00'),
       (1, 2, '2024-07-12', '21:00'),
	   (1, 2, '2024-07-13', '10:00'),
       (1, 2, '2024-07-13', '14:00'),
       (1, 2, '2024-07-13', '21:00'),
       (1, 2, '2024-07-14', '14:00'),
       (1, 2, '2024-07-14', '18:00'),
       (1, 2, '2024-07-14', '21:00'),
	   (1, 2, '2024-07-15', '9:00'),
       (1, 2, '2024-07-15', '20:00'),
	   (1, 2, '2024-07-16', '10:00'),
       (1, 2, '2024-07-16', '14:00'),
       (1, 2, '2024-07-16', '18:00'),
       (1, 2, '2024-07-16', '21:00'),
       (1, 2, '2024-07-17', '21:00');
-- Hà Nội
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES (1, 3, '2024-07-11', '10:00'),
       (1, 3, '2024-07-11', '18:00'),
       (1, 3, '2024-07-11', '21:00'),
	   (1, 3, '2024-07-12', '10:00'),
       (1, 3, '2024-07-12', '14:00'),
       (1, 3, '2024-07-12', '18:00'),
       (1, 3, '2024-07-12', '21:00'),
	   (1, 3, '2024-07-13', '10:00'),
       (1, 3, '2024-07-13', '14:00'),
       (1, 3, '2024-07-13', '21:00'),
       (1, 3, '2024-07-14', '14:00'),
       (1, 3, '2024-07-14', '18:00'),
       (1, 3, '2024-07-14', '21:00'),
	   (1, 3, '2024-07-15', '9:00'),
       (1, 3, '2024-07-15', '20:00'),
	   (1, 3, '2024-07-16', '10:00'),
       (1, 3, '2024-07-16', '14:00'),
       (1, 3, '2024-07-16', '18:00'),
       (1, 3, '2024-07-16', '21:00'),
       (1, 3, '2024-07-17', '21:00');




	   INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES (4, 1, '2024-07-11', '10:00'),
       (4, 1, '2024-07-11', '14:00'),
       (4, 1, '2024-07-11', '18:00'),
       (4, 1, '2024-07-11', '21:00'),
	   (4, 1, '2024-07-12', '10:00'),
       (4, 1, '2024-07-12', '14:00'),
       (4, 1, '2024-07-12', '18:00'),
       (4, 1, '2024-07-12', '21:00'),
	   (4, 1, '2024-07-13', '10:00'),
       (4, 1, '2024-07-13', '14:00'),
       (4, 1, '2024-07-13', '21:00'),
       (4, 1, '2024-07-14', '14:00'),
       (4, 1, '2024-07-14', '18:00'),
       (4, 1, '2024-07-14', '21:00'),
	   (4, 1, '2024-07-15', '9:00'),
       (4, 1, '2024-07-15', '20:00'),
	   (4, 1, '2024-07-16', '10:00'),
       (4, 1, '2024-07-16', '14:00'),
       (4, 1, '2024-07-16', '18:00'),
       (4, 1, '2024-07-16', '21:00'),
       (4, 1, '2024-07-17', '21:00');

-- Hồ Chí Minh
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES (4, 2, '2024-07-11', '10:00'),
       (4, 2, '2024-07-11', '14:00'),
       (4, 2, '2024-07-11', '18:00'),
       (4, 2, '2024-07-11', '21:00'),
	   (4, 2, '2024-07-12', '10:00'),
       (4, 2, '2024-07-12', '14:00'),
       (4, 2, '2024-07-12', '18:00'),
       (4, 2, '2024-07-12', '21:00'),
	   (4, 2, '2024-07-13', '10:00'),
       (4, 2, '2024-07-13', '14:00'),
       (4, 2, '2024-07-13', '21:00'),
       (4, 2, '2024-07-14', '14:00'),
       (4, 2, '2024-07-14', '18:00'),
       (4, 2, '2024-07-14', '21:00'),
	   (4, 2, '2024-07-15', '9:00'),
       (4, 2, '2024-07-15', '20:00'),
	   (4, 2, '2024-07-16', '10:00'),
       (4, 2, '2024-07-16', '14:00'),
       (4, 2, '2024-07-16', '18:00'),
       (4, 2, '2024-07-16', '21:00'),
       (4, 2, '2024-07-17', '21:00');
-- Hà Nội
INSERT INTO showtimes (movie_id, theater_id, show_date, show_time) 
VALUES (4, 3, '2024-07-11', '10:00'),
       (4, 3, '2024-07-11', '18:00'),
       (4, 3, '2024-07-11', '21:00'),
	   (4, 3, '2024-07-12', '10:00'),
       (4, 3, '2024-07-12', '14:00'),
       (4, 3, '2024-07-12', '18:00'),
       (4, 3, '2024-07-12', '21:00'),
	   (4, 3, '2024-07-13', '10:00'),
       (4, 3, '2024-07-13', '14:00'),
       (4, 3, '2024-07-13', '21:00'),
       (4, 3, '2024-07-14', '14:00'),
       (4, 3, '2024-07-14', '18:00'),
       (4, 3, '2024-07-14', '21:00'),
	   (4, 3, '2024-07-15', '9:00'),
       (4, 3, '2024-07-15', '20:00'),
	   (4, 3, '2024-07-16', '10:00'),
       (4, 3, '2024-07-16', '14:00'),
       (4, 3, '2024-07-16', '18:00'),
       (4, 3, '2024-07-16', '21:00'),
       (4, 3, '2024-07-17', '21:00');
select * from Users

-- Table seat
create table seats (
    id int identity primary key,
    row char(1) not null,
    number int not null
);

insert into seats (row, number) values
('A', 1), ('A', 2), ('A', 3), ('A', 4), ('A', 5), ('A', 6), ('A', 7), ('A', 8), ('A', 9),
('B', 1), ('B', 2), ('B', 3), ('B', 4), ('B', 5), ('B', 6), ('B', 7), ('B', 8), ('B', 9),
('C', 1), ('C', 2), ('C', 3), ('C', 4), ('C', 5), ('C', 6), ('C', 7), ('C', 8), ('C', 9),
('D', 1), ('D', 2), ('D', 3), ('D', 4), ('D', 5), ('D', 6), ('D', 7), ('D', 8), ('D', 9),
('E', 1), ('E', 2), ('E', 3), ('E', 4), ('E', 5), ('E', 6), ('E', 7), ('E', 8), ('E', 9),
('F', 1), ('F', 2), ('F', 3), ('F', 4), ('F', 5), ('F', 6), ('F', 7), ('F', 8), ('F', 9);

-- Bảng bookings
create table bookings (
    id int identity(1,1) primary key,
    user_id int foreign key references users(ID),
    showtime_id int foreign key references showtimes(id),
    seat_id varchar(100),
    status varchar(20) not null,
    payment_method varchar(20) not null,
    booking_date date,
    price int
);

insert into bookings (user_id, showtime_id, seat_id, status, payment_method, booking_date, price) values
	(1, 1, '1,2', 'successful', 'qr code', '2024-07-10', 100000),
    (2, 1, '12,13', 'successful', 'qr code', '2024-07-10', 100000),
    (2, 1, '9,18,19', 'successful', 'qr code', '2024-07-10', 150000),
    (2, 2, '5', 'successful', 'qr code', '2024-07-10', 50000),
    (1, 3, '10', 'successful', 'qr code', '2024-07-10', 50000),
	(1, 140, '1,2,5,15,9,6', 'successful', 'qr code', '2024-07-11', '300000');

select b.id as booking_id, s.row, s.number
from bookings b
cross apply string_split(b.seat_id, ',') as seat_ids
inner join seats s on s.id = seat_ids.value
where b.showtime_id = 1;




-- Bảng tickets
create table tickets (
    id int identity primary key,
    booking_id int foreign key references bookings(id),
    seat_id int foreign key references seats(id),
    price int
);